{
    "SWE_projs": {
        "AWS": {
            "title": "Amazon Web Services",
            "date":"Summer 2025",
            "imgLink":"",
            "role":"Software Development Intern",
			"description": "Interned on the AWS Transcribe team, where I built and deployed a new job scheduler system using AWS services that reduced average customer wait times during \"noisy neighbor\" traffic events by 70%. ",
            "tools":"Java, AWS Lambda, AWS Simple Queue Service, CloudWatch, DynamoDB, AWS Throttling",
            "githubLink":"",
            "devpostLink":"",
            "otherLink":"",
            "startDate": "2025-11-11"
        },
		"ALP": {
            "title": "African Library Project Portal",
            "date":"2023-2024",
            "imgLink":"alp",
            "role":"Full Stack Dev & Product Manager",
			"description": "The African Library Project Portal connects & boosts community of the volunteers and admin of the ALP nonprofit, allowing them to track their book drive progress, real-time chat with each other and post via a social forum, view their standings in a leaderboard, and personalize their volunteer profile.",
            "tools":"React.js, Next.js, Express, MongoDB, socketIO, TypeScript",
            "githubLink":"https://github.com/Hack4Impact-Princeton/alp-portal",
            "devpostLink":"",
            "otherLink":"",
            "startDate": "2025-11-10"
        },
        "OpusClip": {
            "title": "OpusClip",
            "date":"Summer 2024",
            "imgLink":"clip",
            "role":"AI Product Management Intern",
			"description": "OpusClip is a start-up that uses AI to turn long form videos into short form clips. As a PM Intern, I focused on the launch of ClipAnything, analyzing data from 5K+ users during our initial beta phase to convert into actionable changes. I also conducted systematic prompt engineering to improve the output quality of ClipAnything's Judge LLM. Towards the end of the internship, I led the sunset plan of the legacy video editing platform, setting the timelines and writing emails to existing users.",
            "tools":"Agile Development, Data Analysis, Documentation, Prompt Engineering",
            "githubLink":"",
            "devpostLink":"",
            "otherLink":"https://www.opus.pro/clipanything",
            "startDate": "2025-11-10"
        },
        
        "Wakey": {
            "title": "Wakey | Mobile App",
            "date":"Oct. 2023",
            "imgLink":"wakey",
            "role":"Mobile Dev @ HackHarvard",
			"description": "Wakey brings human connection to alarm clocks. With Wakey, users and their peers can join the same alarm clock and send each other real-time sounds effects when the alarm goes off to wake up.",
            "tools":"React Native, socketIO, Javascript, Supabase",
            "githubLink":"https://github.com/Need-a-taco/Wakey",
            "devpostLink":"https://devpost.com/software/wakey",
            "otherLink":"",
            "startDate": "2025-11-08"
        },
        "Bundle": {
            "title": "Bundle | Social Web App",
            "date":"Nov. 2022",
            "imgLink":"bundle",
            "role":"Frontend Dev @ HackPrinceton",
			"description": "A simple and fun way to stay connected with friends! Quickly update your mood and send video messages, emotes, and GIFs to peers. On special days, send them a unique NFT :). Winner of Best Design / UXUI Hack",
            "tools":"Javascript, Node.JS, HTML/CSS, socketIO, Flask",
            "githubLink":"https://github.com/derekgeng15/HackPrinceton22",
            "devpostLink":"https://devpost.com/software/bundle-6peq3f",
            "otherLink":"",
            "startDate": "2025-11-07"
        }
    },
    "ML_projs": {
        "MLLM": {
            "title": "Senior Thesis: Investigating Attention in Reasoning v.s Non-Reasoning Vision Language Models",
            "date":"Fall 2025 - Spring 2026 [In Progress]",
            "imgLink":"",
            "role":"",
			"description": "Conducting research in Professor Zhuang Liu's Lab, implementing custom attention visualization pipelines in PyTorch to compare token-to-vision cross-attention in reasoning vs. non-reasoning VLMs for robotics Q&A datasets",
            "tools":"Python, PyTorch, VLMS, Transformers, GPU Computing",
            "githubLink":"",
            "devpostLink":"",
            "otherLink":"",
            "startDate": "2025-11-12"
        },
        "NLP": {
            "title": "Extending Emergent Misalignment",
            "date":"April - May 2025",
            "imgLink":"",
            "role":"NLP Research",
			"description": "Explored how large language models can become misaligned during fine-tuning by replicating and extending experiments from Betley et al. I finetuned and evaluated models like GPT-4o, Qwen, and LLaMA across multiple languages, and designed a custom realignment test pipeline using the OpenAI API to analyze behavioral shifts.",
            "tools":"Python, PyTorch, LoRA Fine-tuning",
            "githubLink":"https://github.com/emluo555/nlp-emergent-misalignment",
            "devpostLink":"",
            "otherLink":"",
            "startDate": "2025-11-11"
        },
        "CamBEV+": {
            "title": "CamBEV+: Birds-Eye-View Images for Night-Time Autonomous Driving ",
            "date":"Jan - May 2025",
            "imgLink":"",
            "role":"Undergraduate Research (Advised by Prof. Olga Russakovsky)",
			"description": "Expanding on the BEVCar paper, built a surround view camera to bird's-eye-view perception pipeline aimed at improving autonomous driving specifically in low-light conditions. I integrated image enhancement models like MIRNet and glare reduction techniques to boost visibility and evaluated object detection and map segmentation performance on the nuScenes dataset.",
            "tools":"Python, PyTorch, MIRNet, OpenCV, nuScenes Dataset",
            "githubLink":"https://github.com/emluo555/CamToBEV",
            "devpostLink":"",
            "otherLink":"",
            "startDate": "2025-11-11"
        },
        "TryOnDiffusion": {
            "title": "TryOnFull: A Modification of TryOnDiffusion",
            "date":"April-May 2024",
            "imgLink":"tryon",
            "role":"Neural Networks Research",
			"description": "This research introduces TryOnFull, a modification of TryOnDiffusion, to generate a 'virtual fitting room' experience that includes both upper & lower body garments using a diffusion-based approach. With minimal architectural changes, TryOnFull shows promising results for generating recognizable full-body images. Future work aims to enhance garment detail and resolution while maintaining an efficient training process.",
            "tools":"PyTorch, Python Image Preprocessing, Diffusion Models, GPU Computing, SLURM",
            "githubLink":"https://github.com/emluo555/tryondiffusion2.0",
            "devpostLink":"",
            "otherLink":"",
            "startDate": "2025-11-10"
        },
        "StereoDiffusionM": {
            "title": "StereoDiffusionM: Diffusion Stereo Image Generation using Marigold Depth Estimation",
            "date":"April-May 2024",
            "imgLink":"stereo",
            "role":"Computer Vision Research",
			"description": "StereoDiffusionM enhances stereo image generation by modifying the depth model and hyperparameters in the StereoDiffusion pipeline. By integrating the Marigold depth model, the approach improves depth accuracy, particularly for background elements, leading to more precise stereo image generation. My paper also discusses the benefits and tradeoffs of this implementation, focusing on image-to-stereo generation.",
            "tools":"Python, PyTorch, Diffusion Models, GPU Computing, SLURM",
            "githubLink":"https://github.com/emluo555/StereoDiffusionM",
            "devpostLink":"",
            "otherLink":"",
            "startDate": "2025-11-10"
        },
        "NJIT_CNN": {
            "title": "Predicting Solar Flare Indices using SHARP Parameters and Line-of-Sight Magnetograms",
            "date":"Summer 2023",
            "imgLink":"solar",
            "role":"ML & Solar Physics Research | National Science Foundation REU @ NJIT",
			"description": "This research aimed to improve the prediction accuracy of high-class solar flares, particularly M and X class flares, which can trigger significant coronal mass ejections (CMEs) affecting Earth. We utilized SHARP parameter data and Line-of-Sight Magnetogram images from 2010-2017, balancing the dataset with Generative Adversarial Networks (GANs) to address data imbalance. Various machine learning models, including a Transformer for time-series data, were tested and compared to previous models to enhance prediction results.",
            "tools":"Python, scikit-learn, PyTorch, Excel, Python Data Analysis",
            "githubLink":"",
            "devpostLink":"",
            "otherLink":"https://centers.njit.edu/spaceweather/",
            "startDate": "2025-11-08"
        }
    },
    "AV_projs": {
        "MolmoAct": {
            "title": "Automatic Steering for MolmoAct using Trajectory Optimization",
            "date":"Fall 2025 [In Progress]",
            "imgLink":"",
            "role":"",
			"description": "Integrating trajectory optimization methods to refine motion planning capabilities of MolmoAct, a new robotics foundation model. We're evaluating on simulation environments like LIBERO and SimplerENV",
            "tools":"Action Reasoning Models, Traj Opt, iLQR, Simulation",
            "githubLink":"",
            "devpostLink":"",
            "otherLink":"",
            "startDate": "2025-11-12"
        },
        "ECE346": {
            "title": "Intelligent Robotic Systems: Truck Lab",
            "date":"April - May 2025",
            "imgLink":"",
            "role":"",
			"description": "Programmed an autonomous mini-truck to navigate a predefined path and avoid obstacles using the Iterative Linear Quadratic Regulator (ILQR) algorithm within the ROS framework. Designed and integrated a real-time safety filter that dynamically adjusted or overrode unsafe trajectories based on ILQR cost evaluations.",
            "tools":"Python, ROS, ILQR, RViz",
            "githubLink":"",
            "devpostLink":"",
            "otherLink":"",
            "startDate": "2025-11-11"
        },
        "TSA": {
            "title": "Transportation Systems Analysis",
            "date":"Fall 2024",
            "imgLink":"orf",
            "role":"",
			"description": "Examined transportation from both the tech & policy planning perspectives; analyzed case studies for autonomous vehicle systems, GPS-based route guidance, Production & Attraction traffic density, etc. The goal is to provide practical insights into the planning and decision-making processes within the industry.",
            "tools":"Systems Analysis, Excel, Current News Synthesis",
            "githubLink":"",
            "devpostLink":"",
            "otherLink":"",
            "startDate": "2025-11-10"
        },
        
        "Robotics": {
            "title": "Intro to Robotics",
            "date":"Fall 2024",
            "imgLink":"irom",
            "role":"",
			"description": "Learned theoretical and algorithmic principles behind robotic systems, with topics such as motion planning, control, localization, mapping, and vision. Implemented vision-based obstacle avoidance on Crazyflie drones.",
            "tools":"Classical Planning, Python, OpenCV, Drones",
            "githubLink":"",
            "devpostLink":"",
            "otherLink":"",
            "startDate": "2025-11-10"
        }
    }
    

}